Detailed Coding Implementations on Pandas DataFrame

Pandas DataFrame is 2-D size-mutable, potentially heterogeneous tabular data structure with 
labelled axes(rows and columns). A DataFrame is a 2-D data structure, i.e., data is aligned in tabular form in rows iand columns. Pandas DataFrame consists of the principle components 
they are: rows, columns, and data.

In [108]:
#Creating the dataframe using list

import pandas as pd
series =['chetan','Veeranna','Kammar','Dr.ait','cse','A']
pd.DataFrame(series)

          0
0    chetan
1  Veeranna
2    Kammar
3    Dr.ait
4       cse
5         A

In [109]:
list=[['chetan',32],['chandana',31],['chinmayi',33]]
pd.DataFrame(list)

          0   1
0    chetan  32
1  chandana  31
2  chinmayi  33

In [163]:
#Data is a 2-D data Structure, i.e., data is aligned in a tabular fashion in rows and columns. We can
#perform basic operation on rows and columns like selecting, deleting, adding, renaming.

data ={'Name'          : ['chetan','prasanna','deekshith','bhrath','Manju'],
        'Age'          : [21,21,22,21,21],
        'Address'      : ['hostel','home','pg','apartment','Hostel'],
        'Qualification': ['Engg','Engg','Engg','Engg','Engg']
        }
ex = pd.DataFrame(data)  #df is the name of the dataframe
ex

        Name  Age    Address Qualification
0     chetan   21     hostel          Engg
1   prasanna   21       home          Engg
2  deekshith   22         pg          Engg
3     bhrath   21  apartment          Engg
4      Manju   21     Hostel          Engg

In [111]:
ex[['Name','Age']]

        Name  Age
0     chetan   21
1   prasanna   21
2  deekshith   22
3     bhrath   21
4      Manju   21

In [167]:
#Slicing teh DataFrame suing loc() and iloc()
#These function help in the convenient selection of the data from dataframe in python.
#They are used for filtering the data according to the conditions. 

data ={'one'   :pd.Series([1,2,3,4]),
        'two'   :pd.Series([10,20,30,40]),
        'three' :pd.Series([100,200,300,400]),
        'four'  :pd.Series([1000,2000,3000,4000])
        }

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [168]:
df.loc[1:2]  #you have to give location/index of the data you want to slice.
df.loc[:] 
df.loc[1:2, 'one':'four']  #slicing particular column datas of index 1,2
df.loc[1:]

   one  two  three  four
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [114]:
df.iloc[::]
df.iloc[:1, :1]  #0th rows, 0th columns
df.iloc[1:-1,1:-1]

   two  three
1   20    200
2   30    300

In [115]:
#selecting the specific column(here three)
df.iloc[:, 2:3]

#selecting the specific rows(here one)
df.iloc[0:1,:]

   one  two  three  four
0    1   10    100  1000

In [116]:
#slicing using the condtiotns

df[df['one']>20]  #in column 'one' there is no data greater than 20
df[df['two']>=30]
df.loc[df['two']>20,['two','three','four']]

   two  three  four
2   30    300  3000
3   40    400  4000

Column Addition in DaraFrame
--using list--pandas--using existing columns

In [117]:
#using list
five = [10000,20000,30000,40000]
df['extra'] = five
df



# df['seven'] = df['one']+10
# df

   one  two  three  four  extra
0    1   10    100  1000  10000
1    2   20    200  2000  20000
2    3   30    300  3000  30000
3    4   40    400  4000  40000

Column Deletion in DataFrame using del--pop

In [118]:
#adding column using pandas series

df['six']=pd.Series([100000,200000,300000,400000])
df

   one  two  three  four  extra     six
0    1   10    100  1000  10000  100000
1    2   20    200  2000  20000  200000
2    3   30    300  3000  30000  300000
3    4   40    400  4000  40000  400000

In [119]:
#adding new column using existing column
df['six'] = df['extra']+10
df

   one  two  three  four  extra    six
0    1   10    100  1000  10000  10010
1    2   20    200  2000  20000  20010
2    3   30    300  3000  30000  30010
3    4   40    400  4000  40000  40010

In [120]:
del df['four']

In [121]:
df

   one  two  three  extra    six
0    1   10    100  10000  10010
1    2   20    200  20000  20010
2    3   30    300  30000  30010
3    4   40    400  40000  40010

In [122]:
df.pop('extra')

0    10000
1    20000
2    30000
3    40000
Name: extra, dtype: int64

In [123]:
df

   one  two  three    six
0    1   10    100  10010
1    2   20    200  20010
2    3   30    300  30010
3    4   40    400  40010

Addition of rows to the DataFrame

In [124]:
df1 = pd.DataFrame([[1,2],[5,6]], columns=['a','b'])
df2 = pd.DataFrame([[9,8],[4,3]], columns=['a','b'])

# df1
# df2

try:
    df3 = df1.concat(df2).reset_index(drop=True)
except AttributeError as ae:
    print('There is an error: ' + str(ae))
except Exception as ex:
    print(ex)
else:
    print("Attribute Error")
finally:
    print("Execution complete")

There is an error: 'DataFrame' object has no attribute 'concat'
Execution complete

Drop function

In [125]:
#axis=0 (Rows-row wise)
#axis=1 (Columns-column wise)


data ={'one'   :pd.Series([1,2,3,4]),
        'two'   :pd.Series([10,20,30,40]),
        'three' :pd.Series([100,200,300,400]),
        'four'  :pd.Series([1000,2000,3000,4000])
        }

droping = pd.DataFrame(data)
droping

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [126]:
#axis=0
droping.drop([0,1], axis=0, inplace=True)    #0,1 = index

In [127]:
droping

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [128]:
#axis=1
droping.drop(['one','three'], axis=1, inplace=True)

In [129]:
droping

   two  four
2   30  3000
3   40  4000

Transposing the DataFrame
--flipping the rows and columns

In [130]:
#converting rows to collumns and vice versa
data ={'one'   :pd.Series([1,2,3,4]),
        'two'   :pd.Series([10,20,30,40]),
        'three' :pd.Series([100,200,300,400]),
        'four'  :pd.Series([1000,2000,3000,4000])
        }
transpose = pd.DataFrame(data)
transpose

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [131]:
#this .axes returns the list of rows and columns in the DataFrame in a pandas
transpose.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

In [132]:
# .ndim gives the dimension of the DataFrame
transpose.ndim

2

In [133]:
#gives te data types of the data
transpose.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

In [134]:
# .shape gives the order(ex. 3*3) of the DataFrame
transpose.shape

(4, 4)

In [135]:
#head() this gives the first n rows of the DataFrame(default n=5)
data ={'one'   :pd.Series([1,2,3,4,5]),
        'two'   :pd.Series([10,20,30,40,50]),
        'three' :pd.Series([100,200,300,400,500]),
        'four'  :pd.Series([1000,2000,3000,4000,5000]),
        'five'  :pd.Series([10000,20000,30000,40000,50000])
        }
transpose = pd.DataFrame(data)
transpose

   one  two  three  four   five
0    1   10    100  1000  10000
1    2   20    200  2000  20000
2    3   30    300  3000  30000
3    4   40    400  4000  40000
4    5   50    500  5000  50000

In [136]:
transpose.head()

   one  two  three  four   five
0    1   10    100  1000  10000
1    2   20    200  2000  20000
2    3   30    300  3000  30000
3    4   40    400  4000  40000
4    5   50    500  5000  50000

In [137]:
transpose.head(3)

   one  two  three  four   five
0    1   10    100  1000  10000
1    2   20    200  2000  20000
2    3   30    300  3000  30000

In [138]:
# tail() this will print the last n rows(default n=5)
transpose.tail()

   one  two  three  four   five
0    1   10    100  1000  10000
1    2   20    200  2000  20000
2    3   30    300  3000  30000
3    4   40    400  4000  40000
4    5   50    500  5000  50000

In [139]:
transpose.tail(3)

   one  two  three  four   five
2    3   30    300  3000  30000
3    4   40    400  4000  40000
4    5   50    500  5000  50000

In [140]:
# empty() this returns whether the given DataFrame is empty.
transpose.empty

False

Statistical or Mathematical Functions

In [141]:
data ={'one'   :pd.Series([1,2,3,4,5]),
        'two'   :pd.Series([10,20,30,40,50]),
        'three' :pd.Series([100,200,300,400,500]),
        'four'  :pd.Series([1000,2000,3000,4000,5000]),
        'five'  :pd.Series([10000,20000,30000,40000,50000])
        }
new=pd.DataFrame(data)
new

   one  two  three  four   five
0    1   10    100  1000  10000
1    2   20    200  2000  20000
2    3   30    300  3000  30000
3    4   40    400  4000  40000
4    5   50    500  5000  50000

In [142]:
#SUM 
new.sum()   #1st columns sum is 15, same for all  the columns

one          15
two         150
three      1500
four      15000
five     150000
dtype: int64

In [143]:
new.mean()   #the average of 1st, 2nd, 3rd, column

one          3.0
two         30.0
three      300.0
four      3000.0
five     30000.0
dtype: float64

In [144]:
new.median()

one          3.0
two         30.0
three      300.0
four      3000.0
five     30000.0
dtype: float64

In [145]:
de = pd.DataFrame({'A':[1,2,3,4,5,4], 'B':[10,20,30,40,50,60]})   #In dictionary the size of the list for the key should be same.
de['A'].mode()
# de['B'].mode()

0    4
Name: A, dtype: int64

In [146]:
new.var()

one              2.5
two            250.0
three        25000.0
four       2500000.0
five     250000000.0
dtype: float64

In [147]:
new.min()

one          1
two         10
three      100
four      1000
five     10000
dtype: int64

In [148]:
new.max()

one          5
two         50
three      500
four      5000
five     50000
dtype: int64

Describing the DataFrame

In [149]:
new.describe()

            one        two       three        four          five
count  5.000000   5.000000    5.000000     5.00000      5.000000
mean   3.000000  30.000000  300.000000  3000.00000  30000.000000
std    1.581139  15.811388  158.113883  1581.13883  15811.388301
min    1.000000  10.000000  100.000000  1000.00000  10000.000000
25%    2.000000  20.000000  200.000000  2000.00000  20000.000000
50%    3.000000  30.000000  300.000000  3000.00000  30000.000000
75%    4.000000  40.000000  400.000000  4000.00000  40000.000000
max    5.000000  50.000000  500.000000  5000.00000  50000.000000

Pipe() Function--allows us to apply the specific function to the whole DataFrame. This is similar to the apply() function.

In [150]:
new

   one  two  three  four   five
0    1   10    100  1000  10000
1    2   20    200  2000  20000
2    3   30    300  3000  30000
3    4   40    400  4000  40000
4    5   50    500  5000  50000

In [155]:
#in pipe() we can take the output of one operation as the input for another operation
def add_(i,j):
    return i+j

def sub(i,j):
    return i-j

def mean(col):
    return col.mean

def square(i):
    return i**2

new.pipe(add_ ,10)
new.pipe(sub, 1)
new.pipe(mean)
#this gives the mean squared

<bound method DataFrame.mean of    one  two  three  four   five
0    1   10    100  1000  10000
1    2   20    200  2000  20000
2    3   30    300  3000  30000
3    4   40    400  4000  40000
4    5   50    500  5000  50000>

apply() -- allows us to apply a function to the DataFrame(either to the individual data or to the entire dataFrame)

In [ ]:
new

   one  two  three  four   five
0    1   10    100  1000  10000
1    2   20    200  2000  20000
2    3   30    300  3000  30000
3    4   40    400  4000  40000
4    5   50    500  5000  50000

In [ ]:
import numpy as np
print(new.apply(np.mean))
print('-------------------------------')
print(new.min())
print('-------------------------------')
new.apply(lambda x: x.max()-x.min())

one          3.0
two         30.0
three      300.0
four      3000.0
five     30000.0
dtype: float64
-------------------------------
one          1
two         10
three      100
four      1000
five     10000
dtype: int64
-------------------------------

one          4
two         40
three      400
four      4000
five     40000
dtype: int64

In [154]:
#applymap() allows you to apply the function to each data to a specicifc column in Dataframe.
import numpy as np
new.applymap(np.float32)

C:\Users\cheta\AppData\Local\Temp\ipykernel_6156\1448675720.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  new.applymap(np.float32)

   one   two  three    four     five
0  1.0  10.0  100.0  1000.0  10000.0
1  2.0  20.0  200.0  2000.0  20000.0
2  3.0  30.0  300.0  3000.0  30000.0
3  4.0  40.0  400.0  4000.0  40000.0
4  5.0  50.0  500.0  5000.0  50000.0

In [ ]:
new.applymap(lambda x: x*10)   #x is each element in the dataFrame

C:\Users\cheta\AppData\Local\Temp\ipykernel_47488\500815631.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  new.applymap(lambda x: x*10)

   one  two  three   four    five
0   10  100   1000  10000  100000
1   20  200   2000  20000  200000
2   30  300   3000  30000  300000
3   40  400   4000  40000  400000
4   50  500   5000  50000  500000

In [ ]:
temp = pd.DataFrame({'A':[1.2, 2.3, 3.4, 5.5], 'B':[7.8,8.7,9.9,7.6]})
temp
print(temp.applymap(np.int64))
print('-----------------------------------')
print(temp.apply(lambda row: row.mean(), axis=0))

   A  B
0  1  7
1  2  8
2  3  9
3  5  7
-----------------------------------
A    3.1
B    8.5
dtype: float64

C:\Users\cheta\AppData\Local\Temp\ipykernel_47488\609307205.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  print(temp.applymap(np.int64))

Reindex Function--we can change the labels of rows or columns

In [ ]:
new
print(new.reindex([1,2,3,4,5]))   #this shuffles the rows and their values according to the index we are giving.append
#you can see for index 5 is Null bcz 'new' dataframe dont have 5th row.
print('--------------------------')
print(new.reindex([0,2,3,4,1]))
print('--------------------------')
new.reindex(columns=['three', 'two','one','four','five'])

   one   two  three    four     five
1  2.0  20.0  200.0  2000.0  20000.0
2  3.0  30.0  300.0  3000.0  30000.0
3  4.0  40.0  400.0  4000.0  40000.0
4  5.0  50.0  500.0  5000.0  50000.0
5  NaN   NaN    NaN     NaN      NaN
--------------------------
   one  two  three  four   five
0    1   10    100  1000  10000
2    3   30    300  3000  30000
3    4   40    400  4000  40000
4    5   50    500  5000  50000
1    2   20    200  2000  20000
--------------------------

   three  two  one  four   five
0    100   10    1  1000  10000
1    200   20    2  2000  20000
2    300   30    3  3000  30000
3    400   40    4  4000  40000
4    500   50    5  5000  50000

Renaming the columns in Oandas Dataframe

In [ ]:
new.rename(columns={'one':'ONE', 'two':'TWO'}, inplace=True)
print(new)
print('-------------------------------------')
new.rename(columns={'one':'ONE', 'two':'TWO'}, inplace=True, index={0:'a', 1:'b'})
print(new)

   ONE  TWO  three  four   five
a    1   10    100  1000  10000
b    2   20    200  2000  20000
2    3   30    300  3000  30000
3    4   40    400  4000  40000
4    5   50    500  5000  50000
-------------------------------------
   ONE  TWO  three  four   five
a    1   10    100  1000  10000
b    2   20    200  2000  20000
2    3   30    300  3000  30000
3    4   40    400  4000  40000
4    5   50    500  5000  50000

In [ ]:
#sorting in pandas
print(temp.sort_values(by = 'A', ascending=True))
print('----------------------------------------')
print(temp.sort_values(by = 'A', ascending=False))
print('----------------------------------------')
print(temp.sort_values(by=['B', 'A']))
print('----------------------------------------')
print(temp.sort_values(by=['A'], kind='quicksort'))
print('----------------------------------------')
print(temp.sort_index())

     A    B
0  1.2  7.8
1  2.3  8.7
2  3.4  9.9
3  5.5  7.6
----------------------------------------
     A    B
3  5.5  7.6
2  3.4  9.9
1  2.3  8.7
0  1.2  7.8
----------------------------------------
     A    B
3  5.5  7.6
0  1.2  7.8
1  2.3  8.7
2  3.4  9.9
----------------------------------------
     A    B
0  1.2  7.8
1  2.3  8.7
2  3.4  9.9
3  5.5  7.6
----------------------------------------
     A    B
0  1.2  7.8
1  2.3  8.7
2  3.4  9.9
3  5.5  7.6

Groupby() Function--is used to split the DataFrame into groups of one or more columns.

In [157]:
cricket = {'Team':['India','India','Australia','Australia','SA','SA','SA','SA','NZ','NZ','NZ','India'],
            'Rank':[2,3,1,2,3,4,1,1,2,4,1,2],
            'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
            'Points':[888, 876,898,856, 768, 976,766, 867, 856, 845, 834, 812]
            }
group = pd.DataFrame(cricket)
group

         Team  Rank  Year  Points
0       India     2  2014     888
1       India     3  2015     876
2   Australia     1  2014     898
3   Australia     2  2015     856
4          SA     3  2014     768
5          SA     4  2015     976
6          SA     1  2016     766
7          SA     1  2017     867
8          NZ     2  2016     856
9          NZ     4  2014     845
10         NZ     1  2015     834
11      India     2  2017     812

In [160]:
print(group.groupby('Team').groups)
print('----------------------------------------')
#to search for specific country with specific year
#group.groupby(['Team','Rank'].get_group(('India',1)))
print('----------------------------------------')
group.groupby('Team').sum(['Points'])

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}
----------------------------------------
----------------------------------------

           Rank  Year  Points
Team
Australia     3  4029    1754
India         7  6046    2576
NZ            7  6045    2535
SA            9  8062    3377